{
    "me_connaitre" : {
        "description" : {
            "id" : "me",
            "title" : "A propos de moi",
            "tags" : [""],
            "imageSrc" : "/img/photo-profil.jpg",
            "content" : [
                "Bonjour, je m'appel Maël Garnier. Je suis passioné d'informatique, de sport de montagne et d'automobile.",
                "Fort de compétences variées en programmation, je suis prêt à relever de nouveaux défis et à contribuer au succès de vos projets."
            ] 
        },
        "lycee" : {
            "id" : "lycee",
            "title" : "Lycée",
            "tags" : [""],
            "imageSrc" : "/img/me connaitre_lycee.svg",
            "content" : [
                "J'ai été scolarisé dans la cité scolaire du diois (Die, Drôme) dans lequel j’ai choisi de suivre les spécialités LLCER anglais (langue, littérature et culture étrangere et régional) et Mathématiques."
            ]
        },
        "universitee" : {
            "id" : "universitee",
            "title" : "Universitée",
            "tags" : [""],
            "imageSrc" : "/img/me_connaitre_universite.svg",
            "content" : [
                "Actuellement étudiant en informatique à l’IUT2 de Grenoble, j'ai choisi ce parcours pour l'accompagnementet la professionnalisation.",
                "Celui-ci m'a permis d'approfondir des compétences tel quel savoir mener à bien un projet, communiquer avec une équipe, mais aussi mettre en pratique un savoir-faire théorique en situation réelle."
            ]
        },
        "competences" : {
            "id" : "competences",
            "title" : "Mes compétences",
            "tags" : [""],
            "imageSrc" : "/img/me_connaitre_competences.svg",
            "content" : [
                "Le choix de la spécialité LLCE anglais au lycée a grandement amélioré mon niveau dans cette langue, me permettant d’atteindre un niveau C1. ",
                "Durant mon parcours universitaire, j'ai su développer en cours et en autonomie de nouvelles compétences : ",
                " - Développement (Java, C, C++, C#, Kotlin, assembleur, python)",
                " - Web (HTML, CSS, JavaScript, Node.js, React.js, PHP, Symfony",
                " - Bases de données (SQL, postgreSQL, SQLite)",
                " - Infrastructure réseaux et déploiements de serveurs",
                " - Conduite de projet (méthodes agiles, SQUARE)"
            ]
        }
    },
    "projets" : {
        "proj4": {
            "id": "proj4",
            "title": "Eveil à l'IUT2",
            "tags": [""],
            "imageSrc": "",
            "content": [
                "Ce premier projet de l'année scolaire 2023/24 était basé sur la réalisation d'un jeu vidéo grâce au langage de programmation Python, en équipe de 4 personnes. Nous devions respecter certaines contraintes, notamment sur le thème du jeu ('le monde merveilleux de l'IUT2'), le gameplay ('garder le rythme') et sur le code (possibilité d'exécuter le code Python avec des paramètres).",
                "Outre l'apprentissage d'un nouveau langage de programmation pendant le projet, la plus grande difficulté fut le temps : nous ne disposions que de 4 jours pour réaliser notre jeu. Ainsi, le projet ne s'est pas résumé au simple codage du jeu, mais surtout à l'organisation de l'équipe et du travail, afin d'optimiser la durée nécessaire au développement.",
                "Ce projet m'a donc non seulement appris à acquérir de nouvelles compétences en développement rapidement (apprentissage d'un nouveau langage de programmation), mais aussi, en tant que chef de groupe, à organiser le travail et à répartir les tâches afin de produire un jeu atteignant les objectifs fixés.",
                "À l'issue de ce projet, un concours a été organisé : chacun des groupes a été réparti parmi 6 poules, contenant chacune 5 groupes. Un jury a sélectionné un groupe sur les 5 pour chacune des poules. Chaque groupe sélectionné s'est ensuite rencontré en finale. Notre groupe a été finaliste et a terminé à la 4ème place."
            ]
        },
        "proj3": {
            "id": "proj3",
            "title": "Step By Step",
            "tags": [""],
            "imageSrc": "",
            "content": [
                "Ce projet a été l'aboutissement de la première année en BUT. L'objectif était de concevoir et réaliser une application de bureau lourde en Java et JavaFX permettant la gestion d'événements de course à pied.",
                "Réalisé en groupe de 5 personnes, notre travail a débuté par des étapes importantes de la gestion de projet, telles que la définition des besoins et des contraintes, l'identification et la qualification des cibles, l'édition de personas, ainsi que l'évaluation des risques.",
                "Une fois ces étapes terminées, nous avons pu passer à une partie plus concrète : la réalisation du wireframe sur Whimsical, suivi de l'élaboration d'un dossier de conception grâce à des outils tels que Visual Paradigm. Le wireframe et le dossier de conception sont deux étapes décisives qui nous ont permis de nous organiser et d'avoir une direction à suivre lors du développement.",
                "Nous avons ensuite pu passer au développement de l'application en utilisant Java, un langage que nous maîtrisons et qui s'est avéré particulièrement adapté pour le développement orienté objet. Nous avons également utilisé Git, un outil primordial pour le codage en équipe.",
                "Le projet s'est conclu par la présentation du produit à un jury à travers un pitch en anglais. Grâce à ce projet, j'ai pu, pour la première fois, suivre une démarche de réalisation d'application complète, apprenant ainsi à mettre en relation toutes les compétences acquises au cours de mon année de BUT.",
                "Ce travail en équipe m'a permis d'apprendre à travailler sur un projet complet, utilisant des outils dédiés au travail collaboratif, et à améliorer mes compétences en communication."
            ]
        },
        "proj2": {
            "id": "proj2",
            "title": "CGI",
            "tags": [""],
            "imageSrc": "",
            "content": [
                "Le but de ce projet, réalisé en trinôme, a été de créer un site web permettant à un élève de troisième cherchant un stage de facilement consulter des informations vulgarisées sur une entreprise du secteur du numérique (ESN).",
                "Dans un premier temps, le travail a consisté à rechercher des informations sur l’entreprise qui nous a été attribué (CGI dans notre cas), et générer un recueil des besoins en vue de la future création du site web.",
                "Une fois cette étape complétée, nous avons mis au point le wireframe de notre site, en respectant les besoins précédemment établis.",
                "Nous sommes par la suite passés au développement en utilisant les langages HTML et CSS.",
                "Au travers de ce projet, j’ai appris à rechercher l’information nécessaire sur internet et à la partager en vue d’une mise en commun avec une équipe. Une partie importante du travail a également consistée à vulgariser ces informations, dans le but de les rendre accessible pour des élèves de troisièmes.",
                "Enfin, j’ai appris à suivre un développement complet d’un site web simple, en partant du recueil de besoins jusqu’à la présentation du produit final.",
                "Il ne faut pas négliger le travail en équipe, qui a su trouver une place importante dans le projet. En effet, il a fallu savoir partager efficacement et simplement notre travail et notre code, et l’adapter pour rendre le produit final cohérent."
            ]
        },
        "proj1": {
            "id": "proj1",
            "title": "Création d'un algorithme",
            "tags": [""],
            "imageSrc": "",
            "content": [
                "Durant ce projet, nous avons appris à implémenter un besoin client concernant diverses approches algorithmiques.",
                "Cela consistait à créer un algorithme capable de reconnaître le sujet sur lequel portent certaines dépêches.",
                "Pour ce faire, nous avons codé un programme en java capable d’analyser une base de données de 500 dépêches portant chacune d’entre elles sur l’un des 5 sujets possibles (sport, politique, environnement - sciences, culture, économie). Une fois que le programme a appris à reconnaître ces sujets à l’aide de cette base de données, il est capable d’analyser le texte de n’importe quelle autre dépêche qui lui est donnée et de déterminer automatiquement leurs sujets.",
                "Cette SAE fut réalisée en binôme, et nous a donc appris à mettre en pratique nos connaissances dans le domaine algorithmique en collaboration, ainsi qu’être capable de communiquer efficacement et d’envoyer et recevoir des feedbacks.",
                "Une présentation finale de notre travail nous a appris à déterminer quels étaient les atouts de notre produit final et de notre collaboration, mais également de mettre au jour quels éléments ont pu bousculer le projet dans son déroulement, et donc comment les résoudre."
            ]
        }
    }
}


